# tap: Homebrew 3rd party storage except for default storage (Formulae)
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# brew
brew "readline"
brew "cask"
brew "curl"
brew "fzf"
brew "git"
brew "git-lfs"
brew "xz"
brew "htop"
brew "mas"
brew "neofetch"
brew "neovim"
brew "putty"
brew "spectacle"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tmux"
brew "qview"
# brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# brew "awscli"
# brew "telnet"
# brew "terraform"
# brew "jenv"
# brew "nvm"
# brew "yarn"
# brew "node.js"
# brew "nginx"
# brew "tomcat@8"

# cask (WEB)
cask "iterm2"
cask "docker"
cask "visual-studio-code"
cask "notion"
cask "google-chrome"
cask "microsoft-office" # office 365(word, excel, ppt, outlook, onedrive)
cask "microsoft-teams"
cask "alfred"
cask "karabiner-elements"
# cask "wireshark" # network packet capture & analysis application
# cask "postman"
# cask "adoptopenjdk/openjdk/adoptopenjdk8"
# cask "mysqlworkbench"

# mas (AppStore): Individual setting
mas "KakaoTalk", id: 869223134
mas "Hancom", id: 416746898 # Hancom Office HWP 2014 VP Viewer
mas "EasyRes", id: 688211836
# mas "MicrosoftRemoteDesktop", id: 1295203466
# mas "TheUnarchiver", id: 425424353
